# **DataFrame Basics III**

## **Sorting dataframes**

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv('titanic.csv')

In [ ]:
titanic.head()

In [ ]:
titanic.age.sort_values()

In [ ]:
titanic.sort_values(by = 'age')

In [ ]:
titanic

In [ ]:
titanic.sort_values(by = 'age', inplace = True)

In [ ]:
titanic.head()

In [ ]:
titanic.sort_index(inplace = True)

In [ ]:
titanic.head()

In [ ]:
titanic.sort_values(by = ['age', 'pclass'], inplace = True)

In [ ]:
titanic.head(20)

In [ ]:
titanic.sort_index(inplace = True)

In [ ]:
titanic.sort_values(by = ['age', 'pclass', 'sex'], ascending = [True, True, False], inplace = True)

In [ ]:
pd.options.display.max_rows = 900

In [ ]:
titanic

In [ ]:
titanic.sort_index()

In [ ]:
pd.options.display.max_rows = 10

In [ ]:
titanic

## **Ranking DataFrames**

In [ ]:
import pandas as pd

In [ ]:
sales = pd.Series([15, 32, 45, 21, 55, 15, 0], index = ["Mon", "Tue", "Wen", "Thu", "Fri", "Sat", "Sun"])

In [ ]:
sales

In [ ]:
sales.sort_values(ascending = False)

In [ ]:
sales.rank(method = 'max', ascending = False)

In [ ]:
sales.rank(method = 'first', ascending = False).sort_values()

In [ ]:
sales.rank(method = 'average', ascending = False).sort_values()

In [ ]:
titanic = pd.read_csv('titanic.csv')

In [ ]:
titanic.head()

In [ ]:
titanic.fare.sort_values(ascending = False)

In [ ]:
titanic.fare.rank(ascending = False)

In [ ]:
titanic.fare.rank(ascending = True, method = 'first').sort_values(ascending = False)

In [ ]:
fare_rank = titanic.fare.rank(ascending = False, method = 'min')

In [ ]:
titanic.insert(column = 'fare_rank', value = fare_rank, loc = 7)

In [ ]:
titanic.head()

In [ ]:
titanic.sort_values(by = 'fare_rank')

## **nunique() and nlargest() / nsmallest() with DataFrames**

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv('titanic.csv')

In [ ]:
titanic.head()

In [ ]:
titanic.tail()

#### **nunique()**

In [ ]:
titanic.age.unique()

In [ ]:
titanic.nunique(axis = 0)

#### **nlargest()**

In [ ]:
titanic.nlargest(columns = 'age', n = 5)

In [ ]:
titanic.sort_values(by = 'age', ascending = False).head()

#### **nsmallest()**

In [ ]:
titanic.nsmallest(n = 5, columns = 'age')

In [ ]:
titanic.sort_values(by = 'age').head()

In [ ]:
titanic.loc[titanic.age.idxmin()]

## **Summary statistics and accumulations**

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv('titanic.csv')

In [ ]:
titanic.head()

In [ ]:
titanic.describe()

In [ ]:
titanic.count()

In [ ]:
titanic.max(numeric_only = True)

In [ ]:
titanic.min(numeric_only = True)

In [ ]:
titanic.mean(numeric_only = True)

In [ ]:
titanic.sum(numeric_only = True)

In [ ]:
titanic.age.cumsum()

In [ ]:
titanic.corr(numeric_only = True)

In [ ]:
titanic.survived.corr(titanic.fare)

## **The agg() method**

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [4]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
titanic.agg('mean', numeric_only = True) # works but it is not recommended

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

In [6]:
titanic.select_dtypes('number').agg('mean')

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

In [7]:
titanic.select_dtypes('number').agg(['mean', 'sum', 'max'])

,survived,pclass,age,sibsp,parch,fare
mean,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
sum,342.000000,2057.000000,21205.170000,466.000000,340.000000,28693.949300
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
titanic.select_dtypes('number').agg({'age': ['min', 'max'], 'fare': ['mean', 'sum']})

        age          fare
min    0.42           NaN
max   80.00           NaN
mean    NaN     32.204208
sum     NaN  28693.949300

In [9]:
def dummy_func(n):
    return 2*n

In [10]:
titanic.select_dtypes('number').agg({'age': ['min', 'max'], 'fare': ['mean', 'sum'], 'fare': dummy_func})

C:\Users\Oggy\AppData\Local\Temp\ipykernel_22224\2743394614.py:1: FutureWarning: using <function dummy_func at 0x000001B5C6A6FB00> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  titanic.select_dtypes('number').agg({'age': ['min', 'max'], 'fare': ['mean', 'sum'], 'fare': dummy_func})

       age       fare
       age dummy_func
min   0.42        NaN
max  80.00        NaN
0      NaN    14.5000
1      NaN   142.5666
2      NaN    15.8500
..     ...        ...
886    NaN    26.0000
887    NaN    60.0000
888    NaN    46.9000
889    NaN    60.0000
890    NaN    15.5000

[893 rows x 2 columns]

In [11]:
titanic.select_dtypes('number').transform(dummy_func)

     survived  pclass   age  sibsp  parch      fare
0           0       6  44.0      2      0   14.5000
1           2       2  76.0      2      0  142.5666
2           2       6  52.0      0      0   15.8500
3           2       2  70.0      2      0  106.2000
4           0       6  70.0      0      0   16.1000
..        ...     ...   ...    ...    ...       ...
886         0       4  54.0      0      0   26.0000
887         2       2  38.0      0      0   60.0000
888         0       6   NaN      2      4   46.9000
889         2       2  52.0      0      0   60.0000
890         0       6  64.0      0      0   15.5000

[891 rows x 6 columns]